defaultproject/app/controllers/articles_controller.rb

	def create
	  @article = Article.new(article_params)

	  if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello"], ["text", "test"], ["created_at", "2016-02-11 18:44:47.290358"], ["updated_at", "2016-02-11 18:44:47.290358"]]

	def update
	  @article = Article.find(params[:id])

	  if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "hello edited"], ["text", "testingediting data"], ["updated_at", "2016-02-11 19:22:54.389188"], ["id", 1]]